Repository: pupik2/plugin
Catalog: *-apps/logs/locale/*/LC_MESSAGES/logs.po
Languages: ru_ru

source: No logs.
ru_ru: Логов нет.

source: By directory
ru_ru: По директориям

source: By file size
ru_ru: По размеру

source: B,KB,MB,GB
ru_ru: Б,кБ,МБ,ГБ

source: Logs
ru_ru: Логи

source: Delete
ru_ru: Удалить

source: Delete file
ru_ru: Удалить файл

source: Deletion of files and directories
ru_ru: Удаление файлов и директорий

source: OK
ru_ru: Понятно

source: Save
ru_ru: Сохранить

source: Download
ru_ru: Скачать

source: By update time
ru_ru: По времени изменения

source: Choose a page
ru_ru: Выберите страницу

source: View previous lines
ru_ru: Предыдущее содержимое

source: View next lines
ru_ru: Следующее содержимое

source: Settings
ru_ru: Настройки

source: PHP error messages are saved to file <em>wa-log/<b>php.log</b></em>.
ru_ru: Сообщения об ошибках PHP сохраняются в файл <em>wa-log/<b>php.log</b></em>.

source: Cannot save changes due to insufficient write permissions for file <em>%s</em>.
ru_ru: Не удалось сохранить изменения из-за недостаточных прав доступа к файлу <em>%s</em>.

source: Enable PHP error log
ru_ru: Включить логирование ошибок PHP

source: no new records
ru_ru: новых записей нет

source: PHP info
ru_ru: Конфигурация PHP

source: PHP info (public link enabled)
ru_ru: Конфигурация PHP (включена публичная ссылка)

source: Common settings management
ru_ru: Управление общими настройками

source: Viewing PHP configuration
ru_ru: Просмотр конфигурации PHP

source: back
ru_ru: назад

source: deleted file
ru_ru: удалил файл

source: published file
ru_ru: опубликовал файл

source: unpublished file
ru_ru: отменил публикацию файла

source: published PHP configuration page
ru_ru: опубликовал страницу с конфигурацией PHP

source: unpublished PHP configuration page
ru_ru: отменил публикацию страницы с конфигурацией PHP

source: set password for published file
ru_ru: установил пароль для опубликованного файла

source: set password for PHP configuration page
ru_ru: установил пароль для опубликованной страницы с конфигурацией PHP

source: removed password for PHP configuration page
ru_ru: убрал пароль для опубликованной страницы с конфигурацией PHP

source: removed password for published file
ru_ru: убрал пароль для опубликованного файла

source: Notify me on large logs size
ru_ru: Уведомлять меня о большом размере логов

source: Show the %s&nbsp;badge next to the app’s icon in the main menu when the total logs size exceeds 1&nbsp;GB.
ru_ru: Показывать индикатор %s рядом с иконкой приложения в главном меню, когда общий размер логов превысит 1&nbsp;ГБ.

source: 1+ GB
ru_ru: 1+ ГБ

source: Reload list
ru_ru: Обновить список

source: PHP errors will be logged without limitations, because “%s” is enabled <a href="%s" target="_blank">in&nbsp;system settings</a>.
ru_ru: Ошибки PHP будут логироваться без ограничений, потому что включен «%s» <a href="%s" target="_blank">в&nbsp;системных настройках</a>.

source: This limitation will not be applied if you enable “%s” setting <a href="%s" target="_blank">in&nbsp;system settings</a>.
ru_ru: Это ограничение не будет действовать, если включить «%s» <a href="%s" target="_blank">в&nbsp;системных настройках</a>.

source: PHP errors will be logged during 1 hour only (until %s), to prevent large error logs from occupying server disk space.
ru_ru: Ошибки PHP будут логироваться только в течение 1 часа (до %s) во избежание заполнения дискового пространства большими файлами логов.

source: Re-enable logging after this time expires, if necessary.
ru_ru: Включите логирование повторно после истечения этого времени, если необходимо.

source: PHP errors will be logged during 1 hour only, to prevent large error logs from occupying server disk space.
ru_ru: Ошибки PHP будут логироваться только в течение 1 часа во избежание заполнения дискового пространства большими файлами логов.

source: Function <tt>phpinfo()</tt>, used to display the PHP configuration, is not available on your server.
ru_ru: Функция <tt>phpinfo()</tt>, использующаяся для показа конфигурации PHP, недоступна на вашем сервере.

source: Close
ru_ru: Закрыть

source: File %s is not published.
ru_ru: Файл %s не опубликован.

source: Published file
ru_ru: Опубликованный файл

source: Insufficient access rights to delete log files or directories.
ru_ru: Недостаточно прав доступа для удаления файлов и директорий.

source: %s is not available for deletion.
ru_ru: %s недоступен для удаления.

source: You have no access rights to publish or unpublish log files.
ru_ru: У вас недостаточно прав доступа для публикации или отмены публикации файлов.

source: This file is not available any more. Reload this page.
ru_ru: Этот файл более не доступен. Обновите страницу.

source: Managing public links to files
ru_ru: Управление публичными ссылками на файлы

source: Password protection
ru_ru: Защита паролем

source: This file is not password-protected.
ru_ru: Этот файл не защищён паролем.

source: set password
ru_ru: установить пароль

source: This file is password-protected.
ru_ru: Этот файл защищён паролем.

source: Password
ru_ru: Пароль

source: change password
ru_ru: изменить пароль

source: remove password
ru_ru: убрать пароль

source: Enter a password
ru_ru: Введите пароль

source: Send
ru_ru: Отправить

source: This file is not published. Reload this page and publish the file.
ru_ru: Этот файл не опубликован. Обновите эту страницу и опубликуйте файл.

source: File %s does not exist or is not accessible.
ru_ru: Файл %s не существует или недоступен.

source: Incorrect password.
ru_ru: Неверный пароль.

source: PHP configuration
ru_ru: Конфигурация PHP

source: View
ru_ru: Просмотр

source: open
ru_ru: открыть

source: Public link
ru_ru: Публичная ссылка

source: Public link (enabled)
ru_ru: Публичная ссылка (включена)

source: The link to your PHP configuration is not password-protected.
ru_ru: Ссылка на страницу с конфигурацией PHP не защищена паролем.

source: The PHP configuration page is not published. Reload this page and try again.
ru_ru: Страница с конфигурацией PHP не опубликована. Обновите страницу и повторите попытку.

source: You have no access rights to publish or unpublish the PHP configuration page.
ru_ru: У вас недостаточно прав доступа для изменения статуса публикации страницы с конфигурацией PHP.

source: This server does not allow viewing the PHP configuration.
ru_ru: Этот сервер не позволяет просматривать конфигурацию PHP.

source: The PHP configuration page is not published.
ru_ru: Страница с конфигурацией PHP не опубликована.

source: The link to the PHP configuration viewing page is password-protected.
ru_ru: Ссылка на страницу просмотра конфигурации PHP защищена паролем.

source: An error has occurred. Reload this page and try again.
ru_ru: Произошла ошибка. Обновите страницу и повторите попытку.

source: Rename
ru_ru: Переименовать

source: Non-authorized persons may view sensitive information about your server configuration.
ru_ru: Неавторизованные пользователи могут просматривать информацию о конфигурации вашего сервера.

source: Name
ru_ru: Имя

source: User actions
ru_ru: Действия пользователей

source: Empty name.
ru_ru: Пустое имя.

source: New name matches the old one.
ru_ru: Новое имя совпадает со старым.

source: Failed to rename to “%s”. Invalid name or insufficient server permissions.
ru_ru: Не удалось переименовать в «%s». Некорректное имя или недостаточно серверных прав доступа.

source: Delete directory
ru_ru: Удалить директорию

source: Show relative file paths instead of absolute paths in error logs
ru_ru: Показывать в логах относительные пути к файлам вместо абсолютных

source: %u published file in this directory will no longer be available via a published link.
ru_ru: %u опубликованный файл в этой директории больше не будет доступен по публичной ссылке.

source: You have no access rights to rename files and directories.
ru_ru: У вас недостаточно прав доступа для переименования файлов директорий.

source: Rename directory
ru_ru: Переименовать директорию

source: Rename file
ru_ru: Переименовать файл

source: This file has a %s&nbsp;published link enabled. It will no longer work after the file is deleted.
ru_ru: Для этого файла включена %s&nbsp;публичная ссылка. Она больше не будет доступна после удаления файла.

source: %u entry
ru_ru: %u запись

source: Directory
ru_ru: Директория

source: Log file
ru_ru: Файл логов

source: User action list
ru_ru: Список действий пользователей

source: User action
ru_ru: Действие пользователей

source: Renaming files and directories
ru_ru: Переименование файлов и директорий

source: Invalid name.
ru_ru: Некорректное имя.

source: The file is not accessible.
ru_ru: Файл недоступен.

source: link disabled
ru_ru: выключена

source: link enabled
ru_ru: включена

source: PHP errors are being logged without limitations, because <tt>php_logging_admin</tt> parameter is enabled in Logs’ configuration file.
ru_ru: Ошибки PHP логируются без ограничений, потому что параметр <tt>php_logging_admin</tt> включён в конфигурационном файле.

source: To make PHP errors be logged only during 1 hour, disable <tt>php_logging_admin</tt> parameter in file <em>%s</em>.
ru_ru: Для того чтобы ошибки PHP логировались только в течение 1 часа, отключите параметр <tt>php_logging_admin</tt> в файле <tt>%s</tt>.

source: PHP errors will be logged without limitations, because <tt>php_logging_admin</tt> parameter is enabled in Logs’ configuration file.
ru_ru: Ошибки PHP будут логироваться без ограничений, потому что параметр <tt>php_logging_admin</tt> включён в конфигурационном файле.

source: PHP errors are being logged without limitations, because the “%s” is enabled <a href="%s" target="_blank">in&nbsp;system settings</a>.
ru_ru: Ошибки PHP логируются без ограничений, потому что «%s» включён <a href="%s" target="_blank">в&nbsp;системных настройках</a>.

source: logs
ru_ru: логи

source: This file’s size
ru_ru: Размер этого файла

source: All log files‘ total size
ru_ru: Размер всех файлов с логами

source: Empty password.
ru_ru: Пустой пароль.

source: in published files
ru_ru: в опубликованных файлах

source: in backend
ru_ru: в бекенде

source: Hide IP addresses in error logs
ru_ru: Скрывать IP-адреса в логах

source: Types of PHP errors
ru_ru: Типы ошибок PHP

source: all
ru_ru: все

source: fatal errors
ru_ru: критичные ошибки

source: warnings
ru_ru: предупреждения

source: A file with this name exists. Enter another name.
ru_ru: Файл с таким именем существует. Введите другое имя.

source: Managing public link to PHP configuration viewing page
ru_ru: Управление публичной ссылкой на страницу просмотра конфигурации PHP

source: You have no access rights to view the PHP configuration.
ru_ru: У вас недостаточно прав доступа для просмотра конфигурации PHP.

source: Add a rule for Logs in the <a %s>Site</a> app’s settings to create a public link.
ru_ru: Добавьте правило для «Логов» в настройках приложения «<a %s>Сайт</a>», чтобы создать публичную ссылку.

source: Open
ru_ru: Открыть

source: Latest update time
ru_ru: Время последнего обновления

source: Error
ru_ru: Ошибка

source: Path
ru_ru: Путь

source: Tracked file
ru_ru: Отслеживаемый файл

source: File updates tracking
ru_ru: Отслеживание изменений файла

source: Tracking
ru_ru: Отслеживание

source: tracking enabled
ru_ru: включено

source: tracking disabled
ru_ru: выключено

source: Track changes
ru_ru: Отслеживание изменений

source: Track changes (enabled)
ru_ru: Отслеживание изменений (включено)

source: Updated tracked file
ru_ru: Обновлённый отслеживаемый файл

source: Once this file is updated, you will see a %s&nbsp;badge next to the app’s icon in the main menu.
ru_ru: Как только этот файл обновится, вы увидите индикатор&nbsp;%s рядом с иконкой приложения в главном меню.

source: You will be further notified on this file’s updates until the “%” option is disabled.
ru_ru: Вы будете продолжать видеть уведомления об обновлениях этого файла, пока не отключите настройку «%s».

source: You will be further notified on this file’s updates <em>by its old name</em> until the “%” option is disabled.
ru_ru: Вы будете продолжать видеть уведомления об обновлениях этого файла <em>по его старому имени</em>, пока не отключите настройку «%s».

source: Other users will be further notified on this file’s updates until the “%” option is disabled.
ru_ru: Другие пользователи будут продолжать видеть уведомления об обновлениях этого файла, пока не отключат настройку «%s».

source: Other users will be further notified on this file’s updates <em>by its old name</em> until the “%” option is disabled.
ru_ru: Другие пользователи будут продолжать видеть уведомления об обновлениях этого файла <em>по его старому имени</em>, пока не отключат настройку «%s».

source: You and other users will be further notified on this file’s updates until the %s&nbsp;“%” option is disabled.
ru_ru: Вы и другие пользователи будете продолжать видеть уведомления об обновлениях этого файла, пока не отключите настройку %s&nbsp;«%s».

source: You and other users will be further notified on this file’s updates <em>by its old name</em> until the “%” option is disabled.
ru_ru: Вы и другие пользователи будете продолжать видеть уведомления об обновлениях этого файла <em>по его старому имени</em>, пока не отключите настройку «%s».

source: You and other users will no longer be notified on %u file’s updates.
ru_ru: Вы и другие пользователи больше не будете видеть уведомления об обновлениях %u файла.

source: You will no longer be notified on %u file’s updates.
ru_ru: Вы больше не будете видеть уведомления об обновлениях %u файла.

source: Other users will no longer be notified on %u file’s updates.
ru_ru: Другие пользователи больше не будут видеть уведомления об обновлениях %u файла.

source: You and other users will no longer be notified on %u file’s updates in this directory.
ru_ru: Вы и другие пользователи больше не будете видеть уведомления об обновлениях %u файла в этой директории.

source: You will no longer be notified on %u file’s updates in this directory.
ru_ru: Вы больше не будете видеть уведомления об обновлениях %u файла в этой директории.

source: Other users will no longer be notified on %u file’s updates in this directory.
ru_ru: Другие пользователи больше не будут видеть уведомления об обновлениях %u файла в этой директории.

source: Only the last line matching the search query is shown per found file.
ru_ru: Для каждого файла показана только последняя из строк, содержащих введённый запрос.

source: No logs found.
ru_ru: Логи не найдены.

source: Size
ru_ru: Размер

source: Search by “%s”
ru_ru: Поиск «%s»

source: Choose
ru_ru: Выбрать

source: Search by file name
ru_ru: Поиск по имени файла

source: Search by text
ru_ru: Поиск по тексту

source: Search
ru_ru: Поиск

source: Search by app, plugin, or widget
ru_ru: Поиск по приложению, плагину или виджету

source: These advanced features will become available after the purchase of the <strong>Logs+</strong> license in %sInstaller%s.
ru_ru: Эти дополнительные возможности станут доступны после покупки лицензии <strong>Логи+</strong> в «%sИнсталлере%s».

source: Start typing any <strong>part of a file name</strong> and quickly open the desired log file from the found list.
ru_ru: Начните писать любую <strong>часть имени файла</strong>, чтобы быстро открыть нужный файл из найденного списка.

source: Search by file text
ru_ru: Поиск по содержимому файлов

source: Type a <strong>word or phrase</strong> to quickly find all files containing the entered text.
ru_ru: Напишите <strong>слово или фразу</strong>, чтобы найти все файлы логов, в которых есть такой текст.

source: Search by app, plugin or widget
ru_ru: Поиск по приложению, плагину или виджету

source: Use the smart search to view only <strong>files related to a certain software product</strong>.
ru_ru: С помощью умного поиска можно легко выбрать файлы логов для <strong>выбранного программного продукта</strong>.

source: Get email notifications on updated files
ru_ru: Email-уведомления об обновлённых файлах

source: Mark <strong>important log files</strong> as <em>tracked</em> %s and enable the <strong>email notification setting</strong> to get the list of those files emailed to you every time their contents are updated.
ru_ru: Отметьте <strong>важные для вас файлы</strong> как <em>отслеживаемые</em> %s и включите отправку <strong>email-уведомлений о них</strong>. Список этих файлов будет отправляться вам по электронной почте каждый раз, когда обновится их содержимое.

source: You can save any <strong>keywords</strong> in the settings to look for in updated files.
ru_ru: Можно сохранить в настройках <strong>ключевые слова</strong>, которые нужно искать в обновлённых файлах.

source: Logs+
ru_ru: Логи+

source: CRON setup
ru_ru: Настройка cron

source: Add the following command to the CRON settings of your cloud account:
ru_ru: Добавьте следующую команду в настройки cron вашего аккаунта в облаке:

source: Add the following command to your server’s CRON settings:
ru_ru: Добавьте следующую команду в настройки cron вашего сервера:

source: Recommended execution frequency is <strong>once an hour every day</strong>.
ru_ru: Рекомендуемая частота выполнения — <strong>каждый день раз в час</strong>.

source: The CRON job is already set up. Last time it worked: %s.
ru_ru: Задание CRON уже настроено. Время последнего срабатывания: %s.

source: Get these features
ru_ru: Получить эти возможности

source: Dear %s,
ru_ru: Здравствуйте, %s!

source: Below is the list of tracked log files in your Webasyst account updated since the last time you viewed them:
ru_ru: Список отслеживаемых файлов с логами в вашем Webasyst-аккаунте, которые были обновлены с того момента, когда вы в последний раз их смотрели:

source: No users have enabled email notifications on tracked files.
ru_ru: Никто из пользователей не включил отправку email-уведомлений об отслеживаемых файлах.

source: Logs app: updated log files you have marked as tracked
ru_ru: Приложение «Логи»: обновлённые файлы, которые вы отметили как отслеживаемые

source: User %s has no email address to send a notification on updated log files.
ru_ru: У пользователя %s нет email-адреса для отправки уведомлений об обновлённых файлах с логами.

source: User %s has no invalid email address to send a notification on updated log files: %s.
ru_ru: В профиле пользователя %s указан некорректный email-адрес для отправки уведомлений об обновлённых файлах с логами: %s.

source: More useful features with Logs+ license
ru_ru: Больше полезных функций с лицензией Логи+

source: app
ru_ru: приложение

source: shipping
ru_ru: доставка

source: payment
ru_ru: оплата

source: plugin
ru_ru: плагин

source: widget
ru_ru: виджет

source: Notify me on updated tracked files
ru_ru: Уведомлять меня об обновлённых отслеживаемых файлах

source: Send me the names of updated tracked files by email.
ru_ru: Отправлять мне названия обновлённых отслеживаемых файлов по email.

source: <a href="javascript:void(0);" class="show-cron-setup-link">CRON setup</a> is required.
ru_ru: Требуется <a href="javascript:void(0);" class="show-cron-setup-link">настройка cron</a>.

source: Check words
ru_ru: Проверять слова

source: Write <strong>words</strong> or <strong>groups of words</strong>, each on a separate line, that must be available in updated tracked log files that you want to be notified of by email.
ru_ru: Напишите <strong>слова</strong> или <strong>словосочетания</strong>, каждое на отдельной строке, которые должны присутствовать в обновлённых отслеживаемых файлах, чтобы получать об этом уведомления по email.

source: You have no email address specified in your <a %s>user profile</a>; no notifications will be sent to you until you add an address.
ru_ru: В вашем <a %s>профиле пользователя</a> не указан email-адрес, поэтому уведомления не будут отправляться, пока вы не добавите адрес.

source: To view other results, enter a more detailed query
ru_ru: Чтобы увидеть другие результаты, введите более подробный поисковый запрос

source: “%s” app
ru_ru: приложение «%s»

source: “%s” plugin (%s)
ru_ru: плагин «%s» (%s)

source: “%s” widget (%s)
ru_ru: виджет «%s» (%s)

source: Webasyst
ru_ru: Вебасист

source: No updated tracked files have been detected.
ru_ru: Нет обновлённых отслеживаемых файлов.

source: Show less search fields
ru_ru: Показать меньше полей поиска

source: Show more search fields
ru_ru: Показать больше полей поиска

source: Webasyst framework
ru_ru: фреймворк Webasyst

source: Delete selected
ru_ru: Удалить выбранное

source: Failed to delete the items marked below. Check server permissions. Or reload this page and try again.
ru_ru: Не удалось удалить отмеченное ниже. Проверьте серверные права доступа. Или обновите страницу и повторите попытку.

source: The Logs+ license is required for bulk deletion.
ru_ru: Требуется лицензия «Логи+» для использования массового удаления.

source: Nothing is selected.
ru_ru: Ничего не выбрано.

source: No allowed files or directories are selected. Please reload this page and try again.
ru_ru: Не выбраны разрешённые файлы или директории. Обновите страницу и повторите попытку.

source: Selected items include some %s&nbsp;<em>directories</em>; the files contained in them are listed here and will be deleted, too.
ru_ru: Выбраны %s&nbsp;<em>директории</em> — содержащиеся в них файлы перечислены здесь и будут также удалены.

source: Some of the files to be deleted have %s&nbsp;<em>published links</em> enabled; they will no longer work after the files are deleted.
ru_ru: Для некоторых из удаляемых файлов включены %s&nbsp;<em>публичные ссылки</em> — они перестанут работать после удаления файлов.

source: Some of the files to be deleted are marked as %s&nbsp;<em>tracked</em>. Users will continue to receive notifications on such files’ updates until they disable the corresponding option once the files are created again.
ru_ru: Некоторые из удаляемых файлов отмечены как %s&nbsp;<em>отслеживаемые</em>. Пользователи будут продолжать получать уведомления об обновлении этих файлов, пока не отключат соответствующую настройку после их повторного создания.

source: To make PHP errors be logged only during 1 hour, disable the “%s”.
ru_ru: Для того чтобы ошибки PHP логировались только в течение 1 часа, отключите «%s».

source: What will be deleted
ru_ru: Что будет удалено

source: The files contained in this directory are listed here and will be deleted, too.
ru_ru: Файлы, содержащиеся в этой директории, перечислены здесь и будут также удалены.

source: This file is marked as %s&nbsp;<em>tracked</em>. Users will continue to receive notifications on its updates until they disable the corresponding option once the file is created again.
ru_ru: Этот файл отмечен как %s&nbsp;<em>отслеживаемый</em>. Пользователи будут продолжать получать уведомления об его обновлении, пока не отключат соответствующую настройку после его повторного создания.

source: Multiple files deletion
ru_ru: Удаление нескольких файлов

source: Select <strong>any number of files and directories</strong> and delete them all in one click.
ru_ru: Выберите <strong>любое количество файлов и директорий</strong> и удалите их все одной кнопкой.

source: Copied to clipboard.
ru_ru: Скопировано в буфер обмена.

source: Add more features
ru_ru: Добавить больше возможностей

source: Search by file names and file contents, filtering by software products, email notifications on updated files, bulk files deletion.
ru_ru: Поиск по именам и содержимому файлов, фильтрация файлов по программным продуктам, email-уведомления об обновлённых файлах, массовое удаление файлов и директорий.

source: Read more
ru_ru: Подробнее

source: Deleting log files does not affect the functioning of your Webasyst account.
ru_ru: Удаление файлов логов не влияет на работу вашего аккаунта Webasyst.
