Repository: pupik2/plugin
Catalog: *-apps/logs/locale/*/LC_MESSAGES/logs.po
Languages: ru_ru

source: You can receive <strong>email notifications</strong> on this file’s updates with the “Logs+” license.
ru_ru: Можно получать <strong>email-уведомления</strong> об обновлениях этого файла — с лицензией «Логи+».

source: You can <strong>delete multiple files at once</strong> with the “Logs+” license.
ru_ru: Можно <strong>удалять сразу несколько файлов</strong> — с лицензией «Логи+».

source: You can <strong>search files</strong> by <em>name</em>, <em>contents</em> and selected <em>product</em> with the “Logs+” license.
ru_ru: Можно <strong>искать файлы</strong> по <em>имени</em>, <em>содержимому</em> и выбранному <em>продукту</em> — с лицензией «Логи+».

source: Files search
ru_ru: Поиск файлов

source: Do not show again
ru_ru: Больше не показывать

source: By search results
ru_ru: По результатам поиска

source: Sort order auto-remembering
ru_ru: Запоминание порядка сортировки

source: Remember sort order
ru_ru: Запоминать порядок сортировки

source: Sort files and directories according to your last choice when opening the app’s home page.
ru_ru: При переходе на главную страницу приложения сортировать файлы и директории в соответствии с вашим последним выбором.

source: The selected sort order can be <strong>auto-remembered</strong> with the “Logs+” license.
ru_ru: Выбранный вариант сортировки может <strong>автоматически запоминаться</strong> — с лицензией «Логи+».

source: Auto-remembered sort order
ru_ru: Автозапоминание сортировки

source: Enable <strong>auto-remembering of the sort order</strong> of files and directories to make them always sorted according to your last choice when you open the app’s home page.
ru_ru: Включите <strong>запоминание порядка сортировки</strong> файлов и директорий, чтобы при открытии главной страницы приложения они всегда были упорядочены в соответствии с вашим последним выбором.
